;; -*- no-byte-compile: t; -*-
;;; private/exwm/packages.el

(package! dmenu)
(package! circadian)
(package! spotify)
(package! pulseaudio-control)
;; (package! gpastel)
(package! xelb :recipe (:fetcher github :repo "ch11ng/xelb"))
(package! exwm :recipe (:fetcher github :repo "ch11ng/exwm"))
(package! color-theme-sanityinc-tomorrow)
(package! anti-zenburn-theme)
(package! kaolin-themes)
(package! nord-theme)
(package! frame-purpose)
(package! frame-workflow :recipe (:fetcher github :repo "akirak/frame-workflow"))
(package! counsel-spotify)
(package! emms)
(package! backlight)
(package! exwm-mff :recipe (:fetcher github :repo "ieure/exwm-mff"))
