;; -*- no-byte-compile: t; -*-
;;; private/sarg/packages.el

(package! ox-hugo)
(package! puppet-mode)
(package! nginx-mode)
(package! multitran)
(package! slack)
(package! webpaste)
(package! dired-filter)
(package! dired-avfs)
(package! dired-du)
(package! dired-collapse)
(package! aria2)
(package! openwith)
(package! web-search)
(package! keyfreq)
(package! dictcc)
(package! goldendict)
(package! mpv)
(package! bencode
  :recipe (:fetcher github :repo "skeeto/emacs-bencode"))
;; (package! ranger)
